# <font color="purple"><h3 align="center">Pandas Concatenate Tutorial</h3></font>

## <font color='blue'>Basic Concatenation</font>

In [52]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [53]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [54]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Ignore_Index parameter</font>

In [55]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

## <font color='blue'>Keys paramater</font><font colour='black'>- concatinating df's as index</font>

In [56]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [57]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [58]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

## <font color='blue'>Concatenation Using Index </font>

In [59]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [60]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","bangalore"],
    "windspeed": [7,12],
}, index=[1,2])
windspeed_df

        city  windspeed
1      delhi          7
2  bangalore         12

In [61]:
df = pd.concat([temperature_df,windspeed_df],axis=1) 
df

       city  temperature       city  windspeed
0    mumbai           32        NaN        NaN
1     delhi           45      delhi        7.0
2  banglore           30  bangalore       12.0

## <font color='blue'>axis parameter </font><font color='black'>-concat in column wise</font>

In [64]:
df = pd.concat([temperature_df,windspeed_df])   # if axis not given,normal row wise concatination will happen
df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2   banglore         30.0        NaN
1      delhi          NaN        7.0
2  bangalore          NaN       12.0

## <font color='blue'>Concatenate dataframe with series</font><font color='black'>-used to add an extra column</font>

In [62]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [63]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain